src/main/java/learnSoap/wsdl/Wsdl/getTDDetail.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<wsdl:definitions xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
xmlns:xsd="http://www.w3.org/2001/XMLSchema"
xmlns:pre1="http://soprabanking.com/amplitude/savings/termDeposit"
xmlns:preAmp="http://soprabanking.com/amplitude"
targetNamespace="http://soprabanking.com/amplitude"
name="getTDDetail">

	<wsdl:types>
		<xsd:schema xmlns:xsd="http://www.w3.org/2001/XMLSchema">
			<xsd:import namespace="http://soprabanking.com/amplitude/savings/termDeposit" schemaLocation="../FlowDescription/getTDDetail.xsd"/>
		</xsd:schema>
	</wsdl:types>

	<wsdl:message name="getTDDetailRequestFlow">
		<wsdl:part name="getTDDetailRequestFlow" element="pre1:getTDDetailRequestFlow"/>
	</wsdl:message>

	<wsdl:message name="getTDDetailResponseFlow">
		<wsdl:part name="getTDDetailResponseFlow" element="pre1:getTDDetailResponseFlow"/>
	</wsdl:message>

	<wsdl:portType name="getTDDetail">
		<wsdl:operation name="getTDDetail">
			<wsdl:input message="preAmp:getTDDetailRequestFlow" name="getTDDetailRequestFlow"/>
			<wsdl:output message="preAmp:getTDDetailResponseFlow" name="getTDDetailResponseFlow"/>
		</wsdl:operation>
	</wsdl:portType>

	<wsdl:binding name="getTDDetail-binding" type="preAmp:getTDDetail">
		<soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
		<wsdl:operation name="getTDDetail">
			<soap:operation soapAction="getTDDetail"/>
			<wsdl:input name="getTDDetailRequestFlow">
				<soap:body use="literal"/>
			</wsdl:input>
			<wsdl:output name="getTDDetailResponseFlow">
				<soap:body use="literal"/>
			</wsdl:output>
		</wsdl:operation>
	</wsdl:binding>

	<wsdl:service name="getTDDetail">
		<wsdl:port binding="preAmp:getTDDetail-binding" name="getTDDetail">
			<soap:address location="http://localhost:8080/getTDDetail"/>
		</wsdl:port>
	</wsdl:service>
</wsdl:definitions>